<h3>Q1. List any five functions of the pandas library with execution

1. `groupby()`:
The groupby() function is used to group data in a pandas DataFrame based on one or more columns. It allows you to split the data into groups based on a criterion and perform operations on each group independently.

In [1]:
import pandas as pd


data = {'Name': ['John', 'Alice', 'Bob', 'Alice', 'John'],
        'City': ['New York', 'London', 'Paris', 'London', 'Paris'],
        'Age': [25, 28, 30, 32, 27]}
df = pd.DataFrame(data)

# Group the DataFrame by 'City' column
grouped_data = df.groupby('City')


sum_age = grouped_data['Age'].sum()
print(sum_age)

City
London      60
New York    25
Paris       57
Name: Age, dtype: int64

2.`concat()`:
The concat() function is used to concatenate pandas objects, such as DataFrames or Series, along a particular axis (rows or columns). It allows you to combine multiple data sources into a single DataFrame.

In [2]:

df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})


result = pd.concat([df1, df2], axis=1)
print(result)

   A  B  A   B
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

3. `merge()`:
The merge() function is used to merge two or more DataFrames based on a common column or index. It allows you to combine data from different sources by aligning the data based on matching values in the specified column(s).

In [3]:
df1 = pd.DataFrame({'ID': [1, 2, 3],
                    'Name': ['John', 'Alice', 'Bob']})
df2 = pd.DataFrame({'ID': [2, 3, 4],
                    'Age': [25, 30, 35]})

# Merge the DataFrames based on 'ID' column
merged_data = pd.merge(df1, df2, on='ID')
print(merged_data)

   ID   Name  Age
0   2  Alice   25
1   3    Bob   30

4. `join()`:
 The join() function is used to join two DataFrames based on their indexes. It combines the columns of two DataFrames into a single DataFrame based on the shared index values.

In [4]:
df1 = pd.DataFrame({'A': [1, 2, 3], 
                    'B': [4, 5, 6]}, 
                   index=['X', 'Y', 'Z'])
df2 = pd.DataFrame({'C': [7, 8, 9], 
                    'D': [10, 11, 12]}, 
                   index=['Y', 'Z', 'W'])

# Join the DataFrames based on their indexes
joined_data = df1.join(df2)
print(joined_data)

   A  B    C     D
X  1  4  NaN   NaN
Y  2  5  7.0  10.0
Z  3  6  8.0  11.0

5.`drop()`:
The drop() function is used to remove specified rows or columns from a DataFrame. It allows you to eliminate unwanted data from your DataFrame.

In [5]:
data = {'A': [1, 2, 3], 
        'B': [4, 5, 6],
        'C': [7, 8, 9]}
df = pd.DataFrame(data)

# Drop column 'B' from the DataFrame
df = df.drop('B',axis=1)
print(df)

   A  C
0  1  7
1  2  8
2  3  9

<h3> Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the 
DataFrame with a new index that starts from 1 and increments by 2 for each row

In [6]:
data = {'A': [1, 2, 3], 
        'B': [4, 5, 6],
        'C': ['sonu', 'seenu', 'pwskills']}
df = pd.DataFrame(data)
df

   A  B         C
0  1  4      sonu
1  2  5     seenu
2  3  6  pwskills

In [7]:
def re_index(df):
    index= pd.RangeIndex(1,len(df)* 2+1,2)
    df = df.set_index(index)
    return df
df2 = re_index(df)
df2

   A  B         C
1  1  4      sonu
3  2  5     seenu
5  3  6  pwskills

<h3> Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that 
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The 
function should print the sum to the console.
    
    

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
calculate and print the sum of the first three values, which is 60

In [8]:
df = pd.DataFrame({'values':[10, 20, 30, 40, 50]})
df

   values
0      10
1      20
2      30
3      40
4      50

In [9]:
def cal_sum(df):
    val=df['values'][:3]
    sum_val=sum(val)
    print(sum_val)
cal_sum(df)

60

<h3>Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 
'Word_Count' that contains the number of words in each row of the 'Text' column

In [10]:
df = pd.DataFrame({"Text":["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language."]})
pd.set_option("display.max_colwidth",1000)

df['word_count']=df['Text'].apply(lambda x: len(x.split()))
df

,Text,word_count
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",104

<h3>Q5. How are DataFrame.size() and DataFrame.shape() different

`DataFrame.size()`:
DataFrame.size() returns the total number of elements in a DataFrame, which is calculated as the product of the number of rows and the number of columns.
It provides the total count of elements, including all cells in the DataFrame, irrespective of whether they contain data or NaN values.
The DataFrame.size() attribute returns a single integer value.

In [11]:
data = {'Column 1': [1, 2, 3,4],
        'Column 2': [4, 5, 6,4]}
df = pd.DataFrame(data)
print(df.size)

8

`DataFrame.shape()`:
DataFrame.shape returns a tuple that represents the dimensions of a DataFrame.
It provides the number of rows followed by the number of columns in the DataFrame.
The DataFrame.shape attribute returns a tuple with two elements: (number of rows, number of columns).

In [12]:
data = {'Column 1': [1, 2, 3,4],
        'Column 2': [4, 5, 6,4]}
df = pd.DataFrame(data)
print(df.shape)

(4, 2)

<h3>Q6. Which function of pandas do we use to read an excel file?

In [13]:
"""To Read an excel file in pandas we can simply use pd.read_excel() function.This function will allow us to read data form an Excel file
and create pandas DataFrame"""

df = pd.read_excel("LUSID Excel - Setting up your market data.xlsx")
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for use with LUSID,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

<h3>Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email 
addresses in the format 'username@domain.com'. Write a Python function that creates a new column 
'Username' in df that contains only the username part of each email address.

In [43]:
df =pd.DataFrame({"Email":['sonu@domain.com','seenu@domain.com','shudhanshu@domain.com','username@domain.com']})

def func_username(df):
    df['Username'] = df['Email'].str.split('@').str[0]
    return df

df1= func_username(df)
df1

                   Email    Username
0        sonu@domain.com        sonu
1       seenu@domain.com       seenu
2  shudhanshu@domain.com  shudhanshu
3    username@domain.com    username

<h3>Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects 
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The 
function should return a new DataFrame that contains only the selected rows.

In [15]:
data ={'A':[3,8,6,2,9],
       'B':[5,2,9,3,1],
       'C':[1,7,4,5,2],
        }
df=pd.DataFrame(data)

def func(df):
    rows= df[(df['A']>5) & (df['B']<10)]
    return rows
df1 = func(df)
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

<h3>Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, 
median, and standard deviation of the values in the 'Values' column

In [24]:
df = pd.DataFrame({'values':[1,2,2,4,5,3,6]})

def cal(df):
    mean = df['values'].mean()
    median = df['values'].median()
    std= df['values'].std()
    
    return mean, median, std

print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std)

Mean: 3.2857142857142856
Median: 3.0
Standard Deviation: 1.7994708216848745

<h3>Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to 
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days 
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and 
should include the current day

In [35]:
data = {"Date": pd.date_range(start='2023-05-1',end='2023-05-20'),
        "Sales":[1,33,33,44,22,43,87,54,3,34,34,22,3,45,2,423,12,3,12,21]
       }
df=pd.DataFrame(data)
df.head()

        Date  Sales
0 2023-05-01      1
1 2023-05-02     33
2 2023-05-03     33
3 2023-05-04     44
4 2023-05-05     22

In [42]:
def func(df):
    df["Moving avg"]=df['Sales'].rolling(window=7).mean()
    return df
df1 = func(df)
df1

         Date  Sales  Moving avg
0  2023-05-01      1         NaN
1  2023-05-02     33         NaN
2  2023-05-03     33         NaN
3  2023-05-04     44         NaN
4  2023-05-05     22         NaN
5  2023-05-06     43         NaN
6  2023-05-07     87   37.571429
7  2023-05-08     54   45.142857
8  2023-05-09      3   40.857143
9  2023-05-10     34   41.000000
10 2023-05-11     34   39.571429
11 2023-05-12     22   39.571429
12 2023-05-13      3   33.857143
13 2023-05-14     45   27.857143
14 2023-05-15      2   20.428571
15 2023-05-16    423   80.428571
16 2023-05-17     12   77.285714
17 2023-05-18      3   72.857143
18 2023-05-19     12   71.428571
19 2023-05-20     21   74.000000

<h3>Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new 
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. 
Monday, Tuesday) corresponding to each date in the 'Date' column

In [58]:
data ={"Date": pd.date_range(start='2023-01-01',end ='2023-01-07')}
df=pd.DataFrame(data)
df

def func(df):
    df["Weekday"]=pd.to_datetime(df['Date']).dt.day_name()
    return df
df1= func(df)
df1

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday
6 2023-01-07   Saturday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'

In [62]:
import pandas as pd

def select_rows_in_date_range(df):
    df['Date'] = pd.to_datetime(df['Date']) 
    mask = (df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')
    selected_rows = df.loc[mask]
    return selected_rows


data = {'Date': ['2022-12-25', '2023-01-15', '2023-02-01', '2023-01-31']}
df = pd.DataFrame(data)

selected_rows = select_rows_in_date_range(df)
print(selected_rows)

        Date
1 2023-01-15
3 2023-01-31

<h3>Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to 
be imported

To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is pandas itself.